{
  "texts": [
    "0000 hours. Admiral, thank you for your hard work with late night missions!",
    "Nn... 0100 hours. Haruna will accompany you! I'm not sleepy at all!",
    "0200 hours. Admiral, you must not lose focus! Haruna will do her best too!",
    "0300 hours. Admiral, Haruna will... stand guard... so you can go to sleep first...",
    "0400... hours. Admiral... Haruna also wants to rest with you... but then the base defences...",
    "0500 hours. A single futon is a bit crowded as expected, but Haruna is warm.",
    "0600 hours. Admiral, it's morning! How are you feeling?",
    "0700 hours. It's completely morning! The Admiral seems to be full of energy. Haruna will also do her best!",
    "0800 hours. Can Haruna join you for breakfast?",
    "0900 hours! Admiral, the sortie preparations are ready!",
    "1000 hours. Please leave today's operation schedule to Haruna!",
    "1100 hours. Admiral, this is Haruna's plan for the day. How about taking a short rest?",
    "1200 hours. You should take a break, Admiral, you're too busy.",
    "1300 hours. Admiral, leisurely having lunch with Haruna like this... is also an important duty...",
    "1400 hours. The kanmusus' morale is rising! Let's all launch at once!",
    "1500 hours. Admiral, the rankings have been updated. How about checking them with Haruna?",
    "1600 hours. Admiral, update the fleet command's comments with Haruna as well!",
    "1700 hours. Haruna is interested in the comments of the admirals around My Rank.",
    "1800 hours. Admiral, it's getting late. It will be night soon.",
    "1900 hours. The night view from the Admiral's office... Haruna loves this.",
    "2000 hours. The hardworking cranes at the dock... Haruna thinks it's kind of romantic.",
    "2100 hours. Haruna will also work hard like the cranes so that she can suppor the Admiral and the fleet!",
    "2200 hours. Haruna said a bit too much tonight. Please forgive me.",
    "2300 hours. Admiral, you should go to bed early sometimes. Please, for Haruna?"
  ]
}